kaidegit/nrf52832_bl_app_ble_ota/src/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "FreeRTOS.h"
#include "task.h"

#include "app_error.h"
#include "app_timer.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_dfu.h"
#include "ble_hci.h"
#include "ble_nus.h"
#include "ble_srv_common.h"
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_bootloader_info.h"
#include "nrf_drv_clock.h"
#include "nrf_gpio.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_power.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_freertos.h"
#include "nrf_sdh_soc.h"
#include "SEGGER_RTT.h"
#include "board_pins.h"
#include "elog_port.h"

#define APP_BLE_OBSERVER_PRIO           3
#define APP_BLE_CONN_CFG_TAG            1
#define APP_RAM_START                   0x20003000UL
#define APP_ADV_INTERVAL                64
#define APP_ADV_DURATION                18000
#define APP_DEVICE_NAME                 "nRF52832_NUS_DFU"
#define APP_TASK_STACK_SIZE             256
#define APP_TASK_PRIORITY               1
#define APP_LOG_PERIOD_MS               1000
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)
#define SLAVE_LATENCY                   0
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)
#define MAX_CONN_PARAMS_UPDATE_COUNT    3
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN
#define OPCODE_LENGTH                   1
#define HANDLE_LENGTH                   2
#define DEAD_BEEF                       0xDEADBEEF

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
NRF_BLE_GATT_DEF(m_gatt);
NRF_BLE_QWR_DEF(m_qwr);
BLE_ADVERTISING_DEF(m_advertising);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH;
static ble_uuid_t m_adv_uuids[] =
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE},
};
static bool m_rtt_initialized;
static bool m_rtt_reused;

static void advertising_start(void * p_context);

#define APP_RTT_LOG(...) do { SEGGER_RTT_printf(0, __VA_ARGS__); SEGGER_RTT_WriteString(0, "\r\n"); } while (0)

static const char * dfu_evt_name(ble_dfu_buttonless_evt_type_t event)
{
    switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
            return "BOOTLOADER_ENTER_PREPARE";
        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            return "BOOTLOADER_ENTER";
        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            return "BOOTLOADER_ENTER_FAILED";
        case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
            return "RESPONSE_SEND_ERROR";
        default:
            return "UNKNOWN";
    }
}

static const char * sdh_state_name(nrf_sdh_state_evt_t state)
{
    switch (state)
    {
        case NRF_SDH_EVT_STATE_ENABLE_PREPARE:
            return "ENABLE_PREPARE";
        case NRF_SDH_EVT_STATE_ENABLED:
            return "ENABLED";
        case NRF_SDH_EVT_STATE_DISABLE_PREPARE:
            return "DISABLE_PREPARE";
        case NRF_SDH_EVT_STATE_DISABLED:
            return "DISABLED";
        default:
            return "UNKNOWN";
    }
}

static const char * pwr_mgmt_evt_name(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
            return "PREPARE_WAKEUP";
        case NRF_PWR_MGMT_EVT_PREPARE_SYSOFF:
            return "PREPARE_SYSOFF";
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            return "PREPARE_DFU";
        case NRF_PWR_MGMT_EVT_PREPARE_RESET:
            return "PREPARE_RESET";
        default:
            return "UNKNOWN";
    }
}

static uint8_t app_gpregret_get(uint32_t reg_id)
{
    uint32_t value = 0;

    if (nrf_sdh_is_enabled() &&
        (sd_power_gpregret_get(reg_id, &value) == NRF_SUCCESS))
    {
        return (uint8_t)value;
    }

    return reg_id == 0 ? nrf_power_gpregret_get() : nrf_power_gpregret2_get();
}

static bool rtt_early_init(void)
{
    if (!m_rtt_initialized)
    {
        m_rtt_reused = elog_port_rtt_init();
        m_rtt_initialized = true;
    }

    return m_rtt_reused;
}

static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    APP_RTT_LOG("[APP] pwr_mgmt event %s (%u), GPREGRET=0x%02x GPREGRET2=0x%02x",
                pwr_mgmt_evt_name(event),
                (unsigned int)event,
                app_gpregret_get(0),
                app_gpregret_get(1));
    return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);

static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    APP_RTT_LOG("[APP] SoftDevice state %s (%u)", sdh_state_name(state), (unsigned int)state);

    if (state == NRF_SDH_EVT_STATE_DISABLED)
    {
        APP_RTT_LOG("[APP] SoftDevice disabled, setting GPREGRET2 skip CRC");
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);
        APP_RTT_LOG("[APP] GPREGRET=0x%02x GPREGRET2=0x%02x before SYSOFF",
                    nrf_power_gpregret_get(),
                    nrf_power_gpregret2_get());
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
{
    .handler = buttonless_dfu_sdh_state_observer,
};

void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

static void log_init(void)
{
    bool rtt_reused = rtt_early_init();
    SEGGER_RTT_WriteString(0, "[APP] log_init enter\r\n");

    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEFAULT_BACKENDS_INIT();
    NRF_LOG_INFO("RTT %s", rtt_reused ? "reused across image jump" : "initialized");
    SEGGER_RTT_WriteString(0, "[APP] log_init done\r\n");
}

static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}

static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void power_management_init(void)
{
    ret_code_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)APP_DEVICE_NAME,
                                          strlen(APP_DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    UNUSED_PARAMETER(p_gatt);

    if ((m_conn_handle == p_evt->conn_handle) &&
        (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("ATT MTU updated to %u, NUS payload %u",
                     p_evt->params.att_mtu_effective,
                     m_ble_nus_max_data_len);
    }
}

static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}

static void qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint16_t length = p_evt->params.rx_data.length;
        uint8_t * p_data = (uint8_t *)p_evt->params.rx_data.p_data;
        ret_code_t err_code = ble_nus_data_send(&m_nus,
                                                p_data,
                                                &length,
                                                m_conn_handle);

        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_NOT_FOUND) &&
            (err_code != NRF_ERROR_RESOURCES))
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(*p_config));
    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}

static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    APP_RTT_LOG("[APP] DFU event %s (%u), conn=0x%04x, GPREGRET=0x%02x GPREGRET2=0x%02x",
                dfu_evt_name(event),
                (unsigned int)event,
                m_conn_handle,
                app_gpregret_get(0),
                app_gpregret_get(1));

    if (event == BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE)
    {
        APP_RTT_LOG("[APP] DFU prepare: stop advertising-on-disconnect");
        ble_adv_modes_config_t config;
        advertising_config_get(&config);
        config.ble_adv_on_disconnect_disabled = true;
        ble_advertising_modes_config_set(&m_advertising, &config);
        APP_RTT_LOG("[APP] DFU prepare: advertising config updated");

        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            ret_code_t err_code =
                sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_RTT_LOG("[APP] DFU prepare: sd_ble_gap_disconnect(0x%04x) -> 0x%08x",
                        m_conn_handle,
                        (unsigned int)err_code);
            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_INVALID_STATE))
            {
                APP_ERROR_CHECK(err_code);
            }
        }
        else
        {
            APP_RTT_LOG("[APP] DFU prepare: no active connection to disconnect");
        }
    }
    else if (event == BLE_DFU_EVT_BOOTLOADER_ENTER)
    {
        APP_RTT_LOG("[APP] DFU enter: bootloader library will request GOTO_DFU reset");
    }
    else if (event == BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED)
    {
        APP_RTT_LOG("[APP] DFU enter failed");
    }
    else if (event == BLE_DFU_EVT_RESPONSE_SEND_ERROR)
    {
        APP_RTT_LOG("[APP] DFU response send error");
        APP_ERROR_CHECK(false);
    }
}

static void services_init(void)
{
    ret_code_t                  err_code;
    nrf_ble_qwr_init_t          qwr_init = {0};
    ble_nus_init_t              nus_init = {0};
    ble_dfu_buttonless_init_t   dfu_init = {0};

    qwr_init.error_handler = qwr_error_handler;
    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    nus_init.data_handler = nus_data_handler;
    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    dfu_init.evt_handler = ble_dfu_evt_handler;
    err_code = ble_dfu_buttonless_init(&dfu_init);
    APP_ERROR_CHECK(err_code);
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        ret_code_t err_code =
            sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void conn_params_init(void)
{
    ble_conn_params_init_t cp_init;
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    ret_code_t err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

static void advertising_init(void)
{
    ble_advertising_init_t init;
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = false;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.srdata.uuids_complete.uuid_cnt  = ARRAY_SIZE(m_adv_uuids);
    init.srdata.uuids_complete.p_uuids   = m_adv_uuids;

    advertising_config_get(&init.config);
    init.evt_handler = NULL;

    ret_code_t err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        {
            ret_code_t err_code;
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            APP_RTT_LOG("[APP] BLE connected: conn=0x%04x", m_conn_handle);
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_RTT_LOG("[APP] QWR assign conn=0x%04x -> 0x%08x",
                        m_conn_handle,
                        (unsigned int)err_code);
            APP_ERROR_CHECK(err_code);
            break;
        }

        case BLE_GAP_EVT_DISCONNECTED:
            APP_RTT_LOG("[APP] BLE disconnected: conn=0x%04x reason=0x%02x",
                        p_ble_evt->evt.gap_evt.conn_handle,
                        p_ble_evt->evt.gap_evt.params.disconnected.reason);
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            APP_RTT_LOG("[APP] BLE PHY update request: conn=0x%04x",
                        p_ble_evt->evt.gap_evt.conn_handle);
            ble_gap_phys_t const phys = {BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO};
            ret_code_t err_code =
                sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_RTT_LOG("[APP] sd_ble_gap_phy_update -> 0x%08x", (unsigned int)err_code);
            APP_ERROR_CHECK(err_code);
            break;
        }

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        {
            APP_RTT_LOG("[APP] BLE sys attr missing: conn=0x%04x",
                        p_ble_evt->evt.gatts_evt.conn_handle);
            ret_code_t err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_RTT_LOG("[APP] sd_ble_gatts_sys_attr_set -> 0x%08x", (unsigned int)err_code);
            APP_ERROR_CHECK(err_code);
            break;
        }

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t const * p_auth =
                &p_ble_evt->evt.gatts_evt.params.authorize_request;
            if (p_auth->type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
            {
                APP_RTT_LOG("[APP] BLE authorize write: conn=0x%04x handle=0x%04x op=0x%02x len=%u first=0x%02x",
                            p_ble_evt->evt.gatts_evt.conn_handle,
                            p_auth->request.write.handle,
                            p_auth->request.write.op,
                            p_auth->request.write.len,
                            p_auth->request.write.len > 0 ? p_auth->request.write.data[0] : 0);
            }
            else
            {
                APP_RTT_LOG("[APP] BLE authorize request: conn=0x%04x type=0x%02x",
                            p_ble_evt->evt.gatts_evt.conn_handle,
                            p_auth->type);
            }
            break;
        }

        case BLE_GATTS_EVT_HVC:
            APP_RTT_LOG("[APP] BLE HVC: conn=0x%04x handle=0x%04x",
                        p_ble_evt->evt.gatts_evt.conn_handle,
                        p_ble_evt->evt.gatts_evt.params.hvc.handle);
            break;

        default:
            break;
    }
}

NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

static void ble_stack_init(void)
{
    ret_code_t err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    uint32_t ram_start = APP_RAM_START;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    if (ram_start > APP_RAM_START)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    ram_start = APP_RAM_START;
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);
}

static void advertising_start(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

static void heartbeat_task(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    nrf_gpio_cfg_output(APP_HEARTBEAT_LED_PIN);
    nrf_gpio_pin_clear(APP_HEARTBEAT_LED_PIN);

    for (;;)
    {
        nrf_gpio_pin_toggle(APP_HEARTBEAT_LED_PIN);
        NRF_LOG_INFO("hello world");
        vTaskDelay(pdMS_TO_TICKS(APP_LOG_PERIOD_MS));
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char * pcTaskName)
{
    UNUSED_PARAMETER(xTask);
    SEGGER_RTT_WriteString(0, "[APP] stack overflow in task: ");
    SEGGER_RTT_WriteString(0, pcTaskName ? pcTaskName : "<unknown>");
    SEGGER_RTT_WriteString(0, "\r\n");
    APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
}

int main(void)
{
    (void)rtt_early_init();
    SEGGER_RTT_WriteString(0, "[APP] main enter\r\n");
    ret_code_t err_code;

    log_init();
    err_code = ble_dfu_buttonless_async_svci_init();
    APP_ERROR_CHECK(err_code);
    clock_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    if (xTaskCreate(heartbeat_task,
                    "heartbeat",
                    APP_TASK_STACK_SIZE,
                    NULL,
                    APP_TASK_PRIORITY,
                    NULL) != pdPASS)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    nrf_sdh_freertos_init(advertising_start, NULL);
    vTaskStartScheduler();

    APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
}
